Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: In addition to the regular set of features you’d expect in a browser, such as tabbed browsing and private browsing, { -brand-name-safari } has some unexpected features as well. For instance, if a user were to right-click a word anywhere on a page inside { -brand-name-safari }, then click Look Up, they’d get a dictionary definition plus entries from the thesaurus, { -brand-name-app-store }, movies and more. { -brand-name-safari }’s Parental Controls are easy to customize, allowing the adults to breathe a little easier when the kids begin to get curious about the internet.
am: በአሳሽ ውስጥ ከሚጠብቁት መደበኛ የባህሪያት ስብስብ በተጨማሪ፣ ለምሳሌ የታጠረ አሰሳ እና የግል አሰሳ፣ { -brand-name-safari } አንዳንድ ያልተጠበቁ ባህሪያትም አሉት። ለምሳሌ፣ አንድ ተጠቃሚ በ{ -brand-name-safari } ውስጥ ባለው ገጽ ላይ በማንኛውም ቦታ ላይ አንድ ቃል በቀኝ ጠቅ ካደረገ፣ ከዚያ ፈልግ የሚለውን ጠቅ ካደረጉ፣ የመዝገበ-ቃላት ፍቺ እና የገቡ ቃሎችን ከ ቴዛውረስ፣ { -brand-name-app-store }፣ ፊልሞች እና ሌሎችም። የ{ -brand-name-safari } የወላጅ ቁጥጥሮች ለማበጀት ቀላል ናቸው፣ ይህም ልጆቹ የበይነመረብ ጉጉት ሲጀምሩ አዋቂዎች ትንሽ እንዲተነፍሱ ያስችላቸዋል።

source: In { -brand-name-firefox }, Private Browsing mode automatically erases your browsing information like passwords, cookies, and history, leaving no trace after you close out the session. { -brand-name-edge } on the other hand, actually records browsing history in their private mode (called “InPrivate”) and it’s a relatively easy task for someone to reconstruct your full browsing history, regardless of whether your browsing was done in regular or InPrivate mode.
am: በ{ -brand-name-firefox } ውስጥ፣ የግል አሰሳ ሁነታ እንደ የይለፍ ቃሎች፣ ኩኪዎች እና ታሪክ ያሉ የአሰሳ መረጃዎችን በራስ ሰር ያጠፋል፣ ክፍለ-ጊዜውን ከዘጉ በኋላ ምንም ዱካ አይተዉም። በሌላ በኩል { -brand-name-edge } በአንጻሩ የአሰሳ ታሪክን በግል ስልታቸው ይመዘግባል (“በግል” ተብሎ የሚጠራው) እና አሰሳዎ የተከናወነው ምንም ይሁን ምን አንድ ሰው ሙሉ የአሰሳ ታሪክዎን እንደገና ለመገንባት በአንፃራዊነት ቀላል ስራ ነው ይህም ከመደበኛ ወይም የግል ሁነታዎን ሳያገናዝብ ሊሆን ይችላል።

source: In-browser screenshot tool
am: የአሳሽ-ውስጥ ቅጽበታዊ ገጽ እይታ መሣሪያ

source: Increase your privacy with { -brand-name-vpn } + { -brand-name-relay }
am: በ{ -brand-name-vpn } + { -brand-name-relay } ግላዊነትዎን ያሳድጉ

source: Individual
am: ግለሰብ

source: Individual and event organization
am: የግለሰብ እና የክስተት ድርጅት

source: In fact, both { -brand-name-chrome } and { -brand-name-firefox } have rigorous security in place. Both include a thing called “sandboxing” which separates the processes of the browser so something like a harmful website doesn’t infect other parts of your laptop or other device.
am: በእርግጥ፣ ሁለቱም { -brand-name-chrome } እና { -brand-name-firefox } ጥብቅ ደህንነት አላቸው። ሁለቱም "ማጠሪያ" የሚባል ነገር ያካትታሉ። ይህም የአሳሹን ሂደቶች የሚለያይ ሲሆን እንደ ጎጂ ድረ-ገጽ ያለ ነገር የጭን ኮምፒውተሮችዎን ሌሎች ክፍሎች ወይም ሌላ መሳሪያዎን እንዳይበክል ነው።

source: Innovation
am: ፈጠራ

source: Installing the <a href="{ $fbcontainer }">extension</a> is easy and, once activated, will open { -brand-name-facebook } in a blue tab each time you use it. Use and enjoy { -brand-name-facebook } normally. { -brand-name-facebook } will still be able to send you advertising and recommendations on their site, but it will be much harder for { -brand-name-facebook } to use your activity collected <strong>off { -brand-name-facebook }</strong> to send you ads and other targeted messages.
am: የ<a href="{ $fbcontainer }">ቅጥያ</a>ን መጫን ቀላል ነው እናም አንዴ ከነቃ { -brand-name-facebook }ን በተጠቀሙ ቁጥር በሰማያዊ ትር ውስጥ ይከፍታል። በመደበኛነት { -brand-name-facebook } ይጠቀሙ እና ይደሰቱ። { -brand-name-facebook } አሁንም በድረገጻቸው ላይ ማስታወቂያ እና ምክሮችን ሊልኩልዎ ይችላሉ፣ነገር ግን ለ{ -brand-name-facebook } የተሰበሰበውን <strong>ከ{ -brand-name-facebook } </strong> እንቅስቃሴዎን ለመጠቀም፣ ማስታወቂያዎችን እና ሌሎች ኢላማ የተደረጉ መልዕክቶችን ለእርስዎ ለመላክ በጣም ከባድ ይሆንባቸዋል።

source: In terms of actual precious RAM usage, the { -brand-name-brave } browser is much heavier than { -brand-name-firefox }. { -brand-name-brave } comes pre-loaded with various features and “add-ons” which can be attributed to its usage of more RAM. { -brand-name-firefox }, on the other hand, lets you decide which add-ons and extensions you want to bolt on.
am: ከትክክለኛው ውድ የ RAM አጠቃቀም አንጻር የ{ -brand-name-brave } አሳሽ ከ{ -brand-name-firefox } የበለጠ ከባድ ነው። { -brand-name-brave } ቀድሞ ከተለያዩ ባህሪያት እና "ማከያዎች" ጋር ተጭኖ ነው የሚመጣው፤ ይህም ተጨማሪ RAM ለመጠቀሙ ምክንያት ነው። { -brand-name-firefox }፣ በሌላ በኩል፣ የትኞቹን ማከያዎች እና ቅጥያዎች ማሰር እንደሚፈልጉ እንዲወስኑ ያስችልዎታል።

source: In terms of features, both { -brand-name-firefox } and { -brand-name-chrome } offer a large library of extensions and plug-ins, with { -brand-name-chrome }’s catalog vastly outnumbering any other browser while nicely integrating with other { -brand-name-google } services, like Gmail and { -brand-name-google } Docs.
am: በባህሪያት፣ ሁለቱም { -brand-name-firefox } እና { -brand-name-chrome } ትልቅ የቅጥያዎች እና ተሰኪዎች ቤተ-መጽሐፍት ይሰጣሉ፣ የ{ -brand-name-chrome } ዝርዝር ከሌላው በእጅጉ ይበልጣል፤ ከሌሎች የ{ -brand-name-google } አገልግሎቶች እንደ Gmail እና { -brand-name-google } Docs ጋር በደንብ የተዋሃደ ነው።

source: In terms of head to head utility, { -brand-name-opera } and { -brand-name-firefox } are close competitors. { -brand-name-opera } may have an advantage in one aspect with its compatibility with and access to { -brand-name-chrome }’s huge extension library. But one significant factor to consider is the fact that { -brand-name-opera }, because it’s built on { -brand-name-chromium }, is a processor-hungry browser with its RAM consumption comparable to { -brand-name-chrome }, which is known for its high CPU usage.
am: እንደ ተወዳዳሪ መገልገያ፣ { -brand-name-opera } እና { -brand-name-firefox } የቅርብ ተፎካካሪዎች ናቸው። { -brand-name-opera } ከግዙፉ የ{ -brand-name-chrome } ትልቅ የቅጥያ ቤተ-ፍርግም ጋር ካለው ተኳኋኝነት እና መዳረሻ ጋር በአንድ በኩል ጥቅም ሊኖረው ይችላል። ነገር ግን ሊታሰብበት የሚገባው አንድ ጉልህ ነገር { -brand-name-opera }፣ በ{ -brand-name-chromium } ላይ ስለተገነባ፣ አስሂያጅ የተራበ አሳሽ ሲሆን የ ራም ፍጆታው ከ{ -brand-name-chrome }፣ ጋር ሊወዳደር የሚችል መሆኑ ነው። እሱም በከፍተኛ ሲፒዩ አጠቃቀሙ ይታወቃል።

source: Internet for people, not profit
am: በይነመረብ ለሰዎች እንጂ፣ ለትርፍ አይደለም

source: It did this by continuing to release software, such as { -brand-name-firefox } and { -brand-name-thunderbird }, and expanding to new areas, such as providing <a href="{ $grants }">grants</a> to support accessibility improvements on the web.
am: ይህን ያደረገው እንደ { -brand-name-firefox } እና { -brand-name-thunderbird } ያሉ ሶፍትዌሮችን መልቀቅን በመቀጠል እና ወደ አዳዲስ አካባቢዎች በማስፋፋት ለምሳሌ <a href="{ $grants }">እርዳታዎችን በማቅረብ ነው። </a> በድር ላይ የተደራሽነት ማሻሻያዎችን ለመደገፍ።

source: It’s a lightning fast door to the best web experience.
am: ለምርጥ የድር ተሞክሮ የመብረቅ ያክል ፈጣኑ በር ነው።

source: It’s a whole family of products designed to keep you safer and smarter online.
am: በመስመር ላይ እርስዎን ደህንነቱ የተጠበቀ እና ብልህ ለማድረግ የተነደፉ አጠቃላይ ምርቶች ቤተሰብ ነው።

source: It’s not unreasonable to expect a high level of data protection and privacy from the products we regularly use to get online. At a minimum, a browser should offer some version of “private browsing mode” that automatically deletes your history and search history so other users on the same computer can’t access it. In this area, all seven of the browsers compared here score points.
am: በመስመር ላይ ለመገኘት በመደበኛነት ከምንጠቀምባቸው ምርቶች ከፍተኛ የውሂብ ጥበቃን እና ግላዊነትን መጠበቅ ምክንያታዊ ነው ። አንድ አሳሽ ቢያንስ የእርስዎን ታሪክ እና የፍለጋ ታሪክ በአንድ ኮምፒውተር ላይ ያሉ ሌሎች ተጠቃሚዎች እንዳይደርሱበት በራስ ሰር የሚሰርዝ “የግል አሰሳ ሁነታ” ስሪት ማቅረብ አለበት። በዚህ መስክ፤ እዚህ ጋ የተነፃፀሩት ሰባቱም አሳሾች በሙሉ ነጥብ ያስመዘገቡ ናቸው።

source: It’s not unreasonable to expect a high level of data protection and privacy from the products we regularly use to get online. At a minimum, a browser should offer some version of “private browsing mode” that automatically deletes your history and search history so other users on the same computer can’t access it. In this area, all six of the browsers compared here score points.
am: በመስመር ላይ ለመገኘት በመደበኛነት ከምንጠቀምባቸው ምርቶች ከፍተኛ የውሂብ ጥበቃን እና ግላዊነትን መጠበቅ ምክንያታዊ ነው ። አንድ አሳሽ ቢያንስ የእርስዎን ታሪክ እና የፍለጋ ታሪክ በአንድ ኮምፒውተር ላይ ያሉ ሌሎች ተጠቃሚዎች እንዳይደርሱበት በራስ ሰር የሚሰርዝ “የግል አሰሳ ሁነታ” ስሪት ማቅረብ አለበት። በዚህ መስክ፤ እዚህ ጋ የተነፃፀሩት ስድስቱም አሳሾች በሙሉ ነጥብ ያስመዘገቡ ናቸው።

source: It’s your internet. Color it the way you want with thousands of tools, themes and extensions. { -brand-name-firefox } is the original alternative browser that puts people before profits.
am: የእርስዎ በይነመረብ ነው። በሺዎች በሚቆጠሩ መሳሪያዎች፣ ገጽታዎች እና ቅጥያዎች በፈለጉት መንገድ ያሳምሩት። { -brand-name-firefox } ሰዎችን ከትርፍ በፊት የሚያስቀድም የመጀመሪያው አማራጭ አሳሽ ነው።

source: It was intended to harness the creative power of thousands of programmers on the internet and fuel unprecedented levels of innovation in the browser market.
am: በሺዎች የሚቆጠሩ የፕሮግራም አዘጋጆችን የመፍጠር ሃይል በበይነመረቡ ላይ ለመጠቀም እና በአሳሽ ገበያ ውስጥ ታይቶ የማይታወቅ የፈጠራ ደረጃን ለማፍሰስ ታስቦ ነበር።

source: Join
am: ይቀላቀሉ

source: Join { -brand-name-firefox }
am: { -brand-name-firefox }ን ይቀላቀሉ

source: Join { -brand-name-firefox } and get the most out of every product — across every device.
am: { -brand-name-firefox }ን ይቀላቀሉ እና ከእያንዳንዱ ምርት ምርጡን ያግኙ - በሁሉም መሳሪያ።

source: Join the community
am: ማህበረሰቡን ይቀላቀሉ

source: Join the fight for a healthy internet.
am: ጤናማ በይነመረብ ለማግኘት ትግሉን ይቀላቀሉ።

source: Join the Waitlist
am: የተጠባባቂ ዝርዝሩን ይቀላቀሉ

source: Just Download The Browser
am: አሳሹን ብቻ ያውርዱ

source: Just like the { -brand-name-firefox } browser, the { -brand-name-brave } browser is free, open source and focused on protecting users’ privacy. { -brand-name-brave } is a relative newcomer to the world of browsers: its maker, { -brand-name-brave } Software, first debuted the browser in January 2016. In this article we’ll compare our { -brand-name-firefox } browser with the { -brand-name-brave } browser in three categories: privacy, utility and portability.
am: ልክ እንደ { -brand-name-firefox } አሳሽ፣ { -brand-name-brave } አሳሽ ነፃ፣ ክፍት ምንጭ እና የተጠቃሚዎችን ግላዊነት በመጠበቅ ላይ ያተኮረ ነው። { -brand-name-brave } ለአሳሾች አለም አንፃራዊ አዲስ መጤ ነው፡ ሰሪው { -brand-name-brave } ሶፍትዌር፣ ለመጀመሪያ ጊዜ አሳሹን በጃንዋሪ 2016 ሰራ። በዚህ ጽሁፍ የኛን{ -brand-name-firefox } አሳሽ ከ{ -brand-name-brave } አሳሽ ጋር በሶስት ምድቦች እናነፃፅራለን፡ ግላዊነት፣ መገልገያ እና ተንቀሳቃሽነት።

source: Keep tabs on all those tabs
am: በእነዚህ ሁሉ ትሮች ላይ ትሮችን አቆይ

source: Keep your passwords safe, and access them across all your synced devices.
am: የይለፍ ቃላትዎን ደህንነት ይጠብቁ እና በሁሉም የተሰናሰሉ መሳሪያዎችዎ ላይ ያግኟቸው።

source: Leadership
am: አመራር

source: Learn about { -brand-name-mozilla }
am: ስለ { -brand-name-mozilla } ይወቁ

source: Learn about { -brand-name-mozilla } and the issues that matter to us.
am: ስለ { -brand-name-mozilla } እና ለእኛ አስፈላጊ ስለሆኑ ጉዳዮች ይወቁ።

source: Learn about the benefits of working at { -brand-name-mozilla } and view open positions around the world.
am: በ{ -brand-name-mozilla } ውስጥ መስራት ስላለው ጥቅም ይወቁ እንዲሁም በዓለም ዙሪያ ያሉ ክፍት የስራ መደቦችን ይመልከቱ።

source: Learn about the values and principles that guide our mission.
am: ተልእኳችንን ስለሚመሩት እሴቶች እና መርሆዎች ይማሩ።

source: Learn about VPNs
am: ስለ VPNs ይወቁ

source: Learn how { -brand-name-firefox } treats your data with respect.
am: { -brand-name-firefox } ውሂብዎን እንዴት በአክብሮት እንደሚይዝ ይወቁ።

source: Learn how each { -brand-name-firefox } product protects and respects your data.
am: እያንዳንዱ የ{ -brand-name-firefox } ምርት እንዴት የእርስዎን ውሂብ እንደሚጠብቅ እና እንደሚያከብረው ይወቁ።

source: Learn how to customize the way { -brand-name-firefox } works.
am: { -brand-name-firefox } የሚሰራበትን መንገድ እንዴት ማበጀት እንደሚችሉ ይወቁ።

source: Learn more about { -brand-name-firefox-quantum }
am: ስለ { -brand-name-firefox-quantum } የበለጠ ይወቁ

source: Learn more about { -brand-name-firefox-relay }
am: ስለ { -brand-name-firefox-relay } የበለጠ ይወቁ

source: Learn more about { -brand-name-lockwise }
am: ስለ { -brand-name-lockwise } የበለጠ ይወቁ

source: Learn more about { -brand-name-pocket }
am: ስለ { -brand-name-pocket } የበለጠ ይወቁ

source: Learn more about the new, low-level, assembly-like language.
am: ስለ አዲሱ፣ ዝቅተኛ ደረጃ፣ ስብሰባ መሰል ቋንቋ የበለጠ ይወቁ።

source: Legal
am: ሕግ ነክ

source: Let’s get started
am: እንጀምር

source: Like { -brand-name-firefox }, { -brand-name-opera } delivers a scrolling tab experience, which means that when you open more tabs than will fit on screen, it scrolls them off screen instead of just continuously shrinking them down. Also both { -brand-name-firefox } and { -brand-name-opera } have a screenshot tool that lets you capture a snapshot of your screen or part of the page. However, the { -brand-name-opera } tool doesn’t give you the ability to create one huge capture of the whole webpage, only the visible portion.
am: ልክ እንደ { -brand-name-firefox }፣ { -brand-name-opera } የማሸብለል ልምድን ያቀርባል፣ ይህ ማለት ከማያ ገፁ መጠን በላይ ብዙ ትሮችን ሲከፍቱ፣ ያለማቋረጥ እያሳነሰ ከመሄድ ይልቅ ከማያ ገጹ ላይ ይሸብልላቸዋል። እንዲሁም ሁለቱም { -brand-name-firefox } እና { -brand-name-opera } የማያዎን ወይም የገጹን ከፊል ፎቶ ማንሳት የሚያስችል ቅፅበታዊ ገጸ እይታ መሳሪያ አላቸው። ነገር ግን፣ የ{ -brand-name-opera } መሳሪያ የሚታየውን ክፍል ብቻ እንጂ የጠቅላላውን ድረ-ገጽ አንድ ትልቅ ቀረጻ ለመፍጠር የሚያስችል ብቃት አይሰጥዎትም።

source: Like { -brand-name-safari }, { -brand-name-firefox } encourages its enthusiastic developer community to create <a { $attrs }>add-ons and extensions</a> to the browser. And since our platform is open-source, there’s a vast selection adding a wealth of functionality.
am: እንደ { -brand-name-safari }፣ { -brand-name-firefox } ቅን ገንቢ ማህበረሰቡ በአሳሹ ላይ <a { $attrs }>ተጨማሪዎች እና ቅጥያዎች</a>ን እንዲፈጥር ያበረታታል። እና የእኛ መድረክ ክፍት ምንጭ ስለሆነ፣ የተግባር ሀብትን የሚጨምር ሰፊ ምርጫ አለ።

source: Like { -brand-name-safari }, we at { -brand-name-firefox } have made a point of focusing on privacy and security. But unlike { -brand-name-safari }, we’ve been standing on the privacy soap box for a long time. In fact, { -brand-name-mozilla } (our parent company) was one of the first voices in the tech community to sound the alarm for online privacy.
am: ልክ እንደ { -brand-name-safari } እኛ በ{ -brand-name-firefox } በግላዊነት እና ደህንነት ላይ የማተኮር ነጥብ አቅርበናል። ነገር ግን ከ{ -brand-name-safari } በተቃራኒ፣ በግላዊነት መያዣ ሳጥን ላይ ለረጅም ጊዜ ቆመናል። በእርግጥ፣ { -brand-name-mozilla } (የእኛ ወላጅ ኩባንያ) በቴክ ማህበረሰብ ውስጥ የመስመር ላይ ግላዊነትን በተመለከተ ማንቂያውን ካሰሙ የመጀመሪያዎቹ ድምጾች አንዱ ነበር።

source: Little Book of Privacy
am: ትንሽ የግላዊነት መጽሐፍ

source: Localize { -brand-name-mozilla }
am: { -brand-name-mozilla }ን አካባቢያዊ አድርግ

source: Looking for a better browser? We’ll compare { -brand-name-firefox } with { -brand-name-chrome }, { -brand-name-edge }, { -brand-name-safari }, { -brand-name-opera } and { -brand-name-ie } to help you make your decision.
am: የተሻለ አሳሽ ይፈልጋሉ? ለውሳኔ እንዲረዳዎ { -brand-name-firefox }ን ከ{ -brand-name-chrome }፣ { -brand-name-edge }፣ { -brand-name-safari }፣ { -brand-name-opera }፣ { -brand-name-opera } እና { -brand-name-ie } ጋር እናነፃፅራለን።

source: Looking for a better browser? We’ll compare { -brand-name-firefox } with { -brand-name-chrome }, { -brand-name-edge }, { -brand-name-safari }, { -brand-name-opera }, { -brand-name-brave } and { -brand-name-ie } to help you make your decision.
am: የተሻለ አሳሽ ይፈልጋሉ? ለውሳኔ እንዲረዳዎ { -brand-name-firefox }ን ከ{ -brand-name-chrome }፣ { -brand-name-edge }፣ { -brand-name-safari }፣ { -brand-name-opera }፣ { -brand-name-brave } እና { -brand-name-ie } ጋር እናነፃፅራለን።

source: Love your life online
am: የመስመር ላይ ሕይወትዎን ይውደዱ

source: Machine Learning
am: ማሽን መማር

source: Made by passionate people like you
am: እንደ እርስዎ ባሉ ቅን ሰዎች የተሰራ

source: Made with respect
am: በአክብሮት የተሰራ

source: Make devices connected to the internet safe, secure and interoperable.
am: ከበይነመረቡ ጋር የተገናኙ መሣሪያዎችን ደህንነቱ የተጠበቀ፣ጥብቅ እና በይነተገናኝ ያድርጉ።

source: Make the most of your { -brand-name-firefox } experience, across every device.
am: በእያንዳንዱ መሳሪያ ላይ የእርስዎን የ{ -brand-name-firefox } ተሞክሮ ምርጡን ይጠቀሙ።

source: Manage your account
am: መለያዎን ያስተዳድሩ

source: Master password
am: ዋና የይለፍ ቃል

source: Master Password
am: ዋና የይለፍ ቃል

source: Mastodon
am: ማስቶዶን

source: Meet our passionate volunteers
am: ቅን በጎ ፈቃደኞቻችንን ያግኙ

source: Meet people in experimental Mixed Reality chatrooms with { -brand-name-firefox }.
am: በሙከራ ድብልቅ እውነታ የመወያያ ክፍል ውስጥ ሰዎችን በ{ -brand-name-firefox } ያግኙ።

source: Meet the { -brand-name-firefox } Family
am: የ{ -brand-name-firefox } ቤተሰብን ያግኙ

source: Meet the not-for-profit behind { -brand-name-firefox } that stands for a better web.
am: ለተሻለ ድር ከሚቆመው ከ{ -brand-name-firefox } በስተጀርባ ያለውን ለትርፍ ያልተቋቋመ ያግኙ።

source: Meet the team that’s building technology for a better internet.
am: ለተሻለ በይነመረብ ቴክኖሎጂን እየገነባ ካለው ቡድን ጋር ይገናኙ።

source: Meet the technology company that puts people before profit.
am: ሰዎችን ከትርፍ የሚያስቀድም የቴክኖሎጂ ኩባንያ ጋር ይገናኙ።

source: Messenger
am: መልእክተኛ

source: Millions of people around the world trust { -brand-name-firefox } Web browsers on { -brand-name-android }, { -brand-name-ios } and desktop computers. Fast. Private. Download now!
am: በዓለም ዙሪያ ያሉ በሚሊዮን የሚቆጠሩ ሰዎች { -brand-name-firefox } የድር አሳሾችን በ{ -brand-name-android }፣ { -brand-name-ios } እና በዴስክቶፕ ኮምፒውተሮች ላይ ያምናሉ። ፈጣን። የግል። አሁኑኑ ያውርዱ!

source: Mission
am: ተልዕኮ

source: Mixed Reality
am: የተቀላቀለ እውነታ

source: Mobile
am: ተንቀሳቃሽ ስልክ

source: Mobile OS availability
am: የተንቀሳቃሽ ስልክ ስርዓተ ክወና መገኘት

source: Monthly
am: ወርሃዊ

source: Monthly plan
am: ወርሃዊ እቅድ

source: More About { -brand-name-mozilla }
am: ስለ { -brand-name-mozilla } ተጨማሪ

source: More { -brand-name-firefox } browser features
am: ተጨማሪ የ{ -brand-name-firefox } የአሳሽ ባህሪያት

source: More people than ever before are using the internet and are experiencing it <a href="{ $all }">in their own language</a>.
am: ከመቼውም ጊዜ በበለጠ ብዙ ሰዎች እይነመረብ እየተጠቀሙ ነው እና <a href="{ $all }">በራሳቸው ቋንቋ</a> እየገጠመው ነው።

source: Most major browsers these days, with the exception of { -brand-name-safari }, work seamlessly across platforms and browsers. { -brand-name-opera } and { -brand-name-firefox } are no exception with both browsers providing excellent portability across every device.
am: በአሁኑ ጊዜ አብዛኛዎቹ ዋና አሳሾች ከ{ -brand-name-safari } በስተቀር በመድረኮች እና አሳሾች ላይ ያለምንም እንከን ይሰራሉ። { -brand-name-opera } እና { -brand-name-firefox } በሁለቱም አሳሾች በሁሉም መሳሪያ ላይ እጅግ በጣም ጥሩ ተንቀሳቃሽነት ከመስጠት የተለዩ አይደሉም።

source: Mozilla Developer Network
am: የሞዚላ ገንቢ አውታረ መረብ

source: Mozilla Festival
am: የሞዚላ ድግስ

source: Mozilla Labs
am: ሞዚላ ቤተ-ሙከራ

source: Mullvad
am: ሙልቫድ

source: New Features
am: አዲስ ባህሪያት

source: New features and tools for a customized { -brand-name-mdn } experience
am: አዲስ ባህሪያት እና መሳሪያዎች ለግል ብጁ የ{ -brand-name-mdn } ልምድ

source: News and volunteer opportunities
am: ዜና እና የበጎ-ፈቃድ እድሎች

source: New versions of { -brand-name-firefox } have come out regularly since then and keep setting new records. The popularity of { -brand-name-firefox } has helped bring choice back to users.
am: ከዚያን ጊዜ ጀምሮ አዲስ የ{ -brand-name-firefox } ስሪቶች በመደበኛነት ወጥተዋል እና አዳዲስ መዝገቦችን ማዘጋጀታቸውን ቀጥለዋል። የ{ -brand-name-firefox } ታዋቂነት ምርጫን ወደ ተጠቃሚዎች እንዲመልስ ረድቷል።

source: No bandwidth restrictions
am: የመተላለፊያ ይዘት ገደቦች የሉም

source: No logging of your network activity
am: የአውታረ መረብ እንቅስቃሴዎ አይመዘገብም

source: Non Technical
am: ሙያዊ ያልሆነ

source: No online activity logs now or ever
am: ምንም የመስመር ላይ የእንቅስቃሴ መዝገብ ማስታወሻዎች አሁን ወይም በጭራሽ የሉም

source: Not many people noticed at the time, but the first version of Phoenix (later renamed to { -brand-name-firefox }) was also released by { -brand-name-mozilla } community members that year with the goal of providing the <a href="{ $charter }">best possible browsing experience</a> to the widest possible set of people.
am: በወቅቱ ብዙ ሰዎች አላስተዋሉም ነበር፣ ነገር ግን የመጀመሪያው የፎኒክስ እትም (በኋላ ወደ { -brand-name-firefox } ተቀይሯል) እንዲሁም በዚያ አመት በ{ -brand-name-mozilla } የማህበረሰብ አባላት የተለቀቀ ሲሆን አላማውም < a href="{ $charter }">ምርጥ የአሰሳ ተሞክሮ</a> እንዲኖረው እና ለሰፊው ማህበረሰብ ማድረስ ነው።

source: Not sure yet?
am: እስካሁን እርግጠኛ አይደሉም?

source: Obsessed with your privacy since 1998
am: ከ1998 ጀምሮ በግላዊነትዎ ተጠምደዋል

source: Of course, we’re not alone in doing this.
am: እርግጥ ነው፣ ይህንን በማድረግ ብቻችንን አይደለንም።

source: One of the most popular ad blockers for { -brand-name-chrome }, { -brand-name-safari } and { -brand-name-firefox } is <a href="{ $url }">AdBlock</a>. Use it to block ads on { -brand-name-facebook }, { -brand-name-youtube } and { -brand-name-hulu }.
am: ለ { -brand-name-chrome } ፣ { -brand-name-safari } እና { -brand-name-firefox } በጣም ታዋቂ የማስታወቂያ አጋጆች አንዱ ‹a href="{ $url }"> AdBlock </a> ነው። በ { -brand-name-facebook } ፣ { -brand-name-youtube } እና { -brand-name-hulu } ላይ ማስታወቂያዎችን ለማገድ ይጠቀሙበት።

source: One subscription for all your devices
am: ለሁሉም የእርስዎ መሣሪያዎች አንድ ምዝገባ

source: On the other side of the coin, with the { -brand-name-firefox } browser, we prefer to keep things simple. { -brand-name-firefox } blocks many third party trackers, cryptominers and fingerprinting trackers from following you by default. However, { -brand-name-firefox }, outside of Private Browsing Mode, chooses not to block display ads from appearing. That is, unless you install <a { $attrs }>one of the extensions specifically designed for that purpose</a>.
am: በሳንቲሙ በሌላኛው ጎን፣ በ{ -brand-name-firefox } አሳሽ፣ ነገሮችን ቀላል ማድረግ እንመርጣለን። { -brand-name-firefox } ብዙ የሶስተኛ ወገን መከታተያ፣ ምናባዊ ገንዘብ ቆፋሪዎች እና የጣት አሻራ መከታተያዎች በነባሪነት እርስዎን እንዳይከተሉ ያግዳል። ነገር ግን፣ { -brand-name-firefox }፣ ከግል አሰሳ ሁነታ ውጭ፣ የማሳያ ማስታወቂያዎች እንዳይታዩ አለማገድን ይመርጣል። ይኸውም <a { $attrs }>ለዚያ ዓላማ ተብለው ከተዘጋጁት ቅጥያዎች ውስጥ አንዱን</a> ካልጫኑ በስተቀር።

source: Open in { -brand-name-firefox }
am: በ{ -brand-name-firefox } ክፈት

source: Option to connect up to { $devices } devices
am: እስከ { $devices } መሳሪያዎች ድረስ የማገናኘት አማራጭ

source: OS availability
am: የስርዓተ ክወና መገኘት

source: Our impact
am: የእኛ ተጽዕኖ

source: Our innovations
am: የእኛ ፈጠራዎች

source: Our Mission
am: የእኛ ተልዕኮ

source: Our mission is to ensure the internet is a global public resource, open and accessible to all. An internet that truly puts people first, where individuals can shape their own experience and are empowered, safe and independent.
am: የእኛ ተልእኮ በይነመረብ ዓለም አቀፍ የህዝብ ሃብት፣ ክፍት እና ለሁሉም ተደራሽ መሆኑን ማረጋገጥ ነው። ሰዎችን በእውነት የሚያስቀድም በይነመረብ ግለሰቦች የራሳቸውን ልምድ የሚቀርጹበት እና ሃይል ያላቸው፣ ደህንነቱ የተጠበቀ እና እራሳቸውን የቻሉበት።

source: Our Private Browsing mode blocks trackers and erases your passwords, cookies and history every time you close it. But you can also experience our advanced privacy features even in regular browsing mode. With the latest edition of { -brand-name-firefox }, enhanced tracking prevention is turned on by default. This prevents things like cross-site trackers from following you as you jump around the web. Also, with { -brand-name-facebook } being caught out almost daily for privacy problems, our <a { $attrs }>{ -brand-name-facebook-container }</a> extension makes a lot of sense. It makes it harder for { -brand-name-facebook } to track you around the web — similar to what { -brand-name-safari } does to prevent cross-site tracking — but { -brand-name-firefox } actually isolates your { -brand-name-facebook } session into a separate container blocking { -brand-name-facebook } from tracking what you do on other websites. Why do they need to know what you look up on WebMD anyway?
am: የእኛ የግል አሰሳ ሁኔታ መከታተያዎችን ያግዳል እና የይለፍ ቃላትዎን፣ ኩኪዎችዎን እና ታሪክዎን በዘጉ ቁጥር ይሰርዛል። ነገር ግን በመደበኛ የአሰሳ ሁነታም ቢሆን የላቁ የግላዊነት ባህሪያቶቻችንን ሊለማመዱ ይችላሉ። በአዲሱ የ{ -brand-name-firefox } እትም የተሻሻለ የመከታተያ መከላከል በነባሪ በርቷል። ይሄ በድሩ ላይ ዘልለው ሲገቡ እንደ ጣቢያ ተሻጋሪ ዱካዎች ያሉ እርስዎን እንዳይከተሉ ይከለክላል። እንዲሁም፣ { -brand-name-facebook } ለግላዊነት ችግሮች በየቀኑ ማለት ይቻላል ፣ ይያዛል፣ የእኛ <a { $attrs }>{ -brand-name-facebook-container }</a> ቅጥያ በጣም ትርጉም ይሰጣል። { -brand-name-facebook } እርስዎን በድር ላይ መከታተል ከባድ ያደርገዋል - ልክ { -brand-name-safari } የጣቢያ መሻገሪያን ለመከላከል ከሚያደርገው ጋር ተመሳሳይ ነው - ግን { -brand-name-firefox } በትክክል ይለያል የእርስዎ { -brand-name-facebook } ክፍለ ጊዜ ወደ ሌላ መያዣ ውስጥ በማስገባት { -brand-name-facebook } በሌሎች ድረ-ገጾች ላይ የሚያደርጉትን እንዳይከታተል ይከለክላል። ለማንኛውም በWebMD ላይ ምን እንደሚመለከቱ ማወቅ ለምን አስፈለጋቸው?

source: Our Products
am: የእኛ ምርቶች

source: Our Promise
am: የኛ ቃል

source: Out of the gate, { -brand-name-firefox } has more features and integrations built into the browser and readily available on download. And while both browsers have a tremendous number of add-ons and extensions available, { -brand-name-edge }’s compatibility with { -brand-name-google }’s { -brand-name-chromium } platform gives it the advantage in terms of sheer numbers.
am: ከዚህ ውጭ፣ { -brand-name-firefox } በአሳሹ ውስጥ የተገነቡ ተጨማሪ ባህሪያት እና ውህደቶች እንዲሁም ዝግጁ የሆኑ ውርዶች አሉት። እንዲሁም ሁለቱም አሳሾች እጅግ በጣም ብዙ ተጨማሪዎች እና ቅጥያዎች ሲኖራቸው፣ የ{ -brand-name-edge } ከ{ -brand-name-google } { -brand-name-chromium } መድረክ ጋር መጣጣሙ ከቁጥሮች አንፃር ፍፁም ጥቅም ይሰጠዋል።

source: Overall Assessment
am: አጠቃላይ ምዘና
